bench/tier3_results/T3-01_20260628_203307.txt
Running 30s test @ http://127.0.0.1:19090/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.14ms    7.59ms  26.50ms   59.62%
    Req/Sec   130.25     38.99   180.00     50.00%
  Latency Distribution
     50%   16.69ms
     75%   23.07ms
     90%   25.36ms
     99%   26.50ms
  52 requests in 30.10s, 5.59KB read
  Socket errors: connect 0, read 254, write 516874, timeout 0
Requests/sec:      1.73
Transfer/sec:     190.01B