bench/tier3_results/T3-01_20260628_235424.txt
Running 30s test @ http://127.0.0.1:19090/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.92ms   12.49ms 140.23ms   86.77%
    Req/Sec     3.39k     1.33k   10.64k    80.72%
  Latency Distribution
     50%    5.57ms
     75%   14.31ms
     90%   26.19ms
     99%   56.09ms
  402102 requests in 30.09s, 42.18MB read
Requests/sec:  13363.52
Transfer/sec:      1.40MB