bench/tier3_results/run_20260628_160548.log
[T3] ╔══════════════════════════════════════════════════════════╗
[T3] ║         Wolf Language — Tier 3 Load Test Suite           ║
[T3] ║  Target: http://127.0.0.1:19090                        ║
[T3] ╚══════════════════════════════════════════════════════════╝
[T3] 
[T3] Building Wolf server: ./e2e/testdata/61_route_ping.wolf
[T3] Starting Wolf server on port 19090...
[T3] Server ready on port 19090 (pid 51802)
[T3] 
[T3] ── T3-01: Baseline Throughput (/ping, 4t/100c/30s) ──
[T3] Running T3-01: Baseline /ping throughput
Running 30s test @ http://127.0.0.1:19090/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.86ms   10.53ms 131.05ms   88.20%
    Req/Sec     2.93k     0.92k    8.68k    80.14%
  Latency Distribution
     50%    6.99ms
     75%   13.34ms
     90%   22.26ms
     99%   50.08ms
  350343 requests in 30.09s, 36.75MB read
  Non-2xx or 3xx responses: 4
Requests/sec:  11641.69
Transfer/sec:      1.22MB
❌ FAIL T3-01: RPS 11641.69 < required 40000
❌ FAIL T3-01: p99 50.08ms > limit 5ms
❌ FAIL T3-01: 4 errors (max allowed: 0)
[T3] 
[T3] ── T3-02: JSON Serialization Throughput (4t/100c/30s) ──
⚠️  WARN T3-02 currently uses /ping (small JSON). Wire a /users/1 endpoint with 1KB JSON for full spec compliance.
[T3] Running T3-02: JSON payload throughput
Running 30s test @ http://127.0.0.1:19090/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.55ms    6.05ms  29.98ms   88.42%
    Req/Sec     1.40k     2.27k    4.02k    66.67%
  Latency Distribution
     50%  453.00us
     75%    4.57ms
     90%   10.68ms
     99%   27.12ms
  417 requests in 30.10s, 44.58KB read
  Socket errors: connect 0, read 269, write 620938, timeout 0
  Non-2xx or 3xx responses: 19
Requests/sec:     13.85
Transfer/sec:      1.48KB
❌ FAIL T3-02: RPS 13.85 < required 20000
❌ FAIL T3-02: p99 27.12ms > limit 10ms
❌ FAIL T3-02: 19 errors (max allowed: 0)
[T3] 
[T3] ── T3-05: Overload Test (8t/500c/30s) ──
unable to connect to 127.0.0.1:19090 Connection refused
⚠️  WARN T3-05: could not parse total requests from wrk output
[T3] Server stopped (pid 51802)
[T3] 
[T3] ── T3-04: Memory Stability (5-minute run) ──
⚠️  WARN T3-04 requires a manual run. Start your Wolf server, then run:
⚠️  WARN   watch -n 10 'ps aux | grep wolf | grep -v grep | awk "{print \$6}"'
⚠️  WARN   Plot with: cat ./bench/tier3_results/rss_samples_*.txt | python3 bench/plot_results.py
⚠️  WARN Auto-sampling is available via WOLF_MEM_TEST=1 environment variable.
[T3] 
[T3] ── T3-03: DB-bound Throughput — Manual Only ──
⚠️  WARN T3-03 requires a live DB. Start a Wolf server with a SELECT route,
⚠️  WARN then run: /tmp/wrk/wrk -t4 -c150 -d60s http://localhost:PORT/users/1
⚠️  WARN Pass criteria: >= 8,000 RPS, zero panics, connection pool holds.
⚠️  WARN Current bench results are in bench/results_real_wolf.txt
[T3] 
[T3] ╔══════════════════════════════════════════════════════════╗
[T3] ║                    T3 Suite Summary                      ║
[T3] ║  Passed: 0  Failed: 2                                ║
[T3] ╚══════════════════════════════════════════════════════════╝
[T3] Full log: ./bench/tier3_results/run_20260628_160548.log