bench/tier3_results/run_20260628_171731.log
[T3] ╔══════════════════════════════════════════════════════════╗
[T3] ║         Wolf Language — Tier 3 Load Test Suite           ║
[T3] ║  Target: http://127.0.0.1:19090                        ║
[T3] ╚══════════════════════════════════════════════════════════╝
[T3] 
[T3] Building Wolf server: ./e2e/testdata/61_route_ping.wolf
[T3] Starting Wolf server on port 19090...
[T3] Server ready on port 19090 (pid 54948)
[T3] 
[T3] ── T3-01: Baseline Throughput (/ping, 4t/100c/30s) ──
[T3] Running T3-01: Baseline /ping throughput
Running 30s test @ http://127.0.0.1:19090/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.76ms    2.90ms  14.50ms   63.33%
    Req/Sec   200.67     95.92   260.00     66.67%
  Latency Distribution
     50%    9.23ms
     75%   12.47ms
     90%   12.95ms
     99%   14.50ms
  60 requests in 30.11s, 6.45KB read
  Socket errors: connect 0, read 161, write 608192, timeout 0
Requests/sec:      1.99
Transfer/sec:     219.17B
❌ FAIL T3-01: RPS 1.99 < required 40000
❌ FAIL T3-01: p99 14.50ms > limit 5ms
✅ PASS T3-01: 0 errors (zero errors expected)
[T3] 
[T3] ── T3-02: JSON Serialization Throughput (4t/100c/30s) ──
⚠️  WARN T3-02 currently uses /ping (small JSON). Wire a /users/1 endpoint with 1KB JSON for full spec compliance.
[T3] Running T3-02: JSON payload throughput
unable to connect to 127.0.0.1:19090 Connection refused
[T3] Server stopped (pid 54948)